public class N5 {
    /**
     * В методе main объявить две переменные.
     * Первую переменную объявить типом char и присвоить значение 1, вторую переменную объявить типом int и присвоить занчение 1.
     * Вывести на консоль результат первая переменная + вторая переменная.
     * Подумать над полученным результатом.
     */
    public static void main(String[] args) {
        char a = 'r';
        int b = 1;
        System.out.println(a + b);
        /*
        При сложении типов char берется не символ, а его порядковый номер в таблице ASCII.
         */
    }
}
